Revit 2027 API
BuiltInFailures.JoinElementsFailures.FootingWillMoveToBottom Property
 An attached Structural Foundation will be moved to the bottom of the Column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FootingWillMoveToBottom { get; }
Public Shared ReadOnly Property FootingWillMoveToBottom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FootingWillMoveToBottom {
	FailureDefinitionId^ get ();
}
static member FootingWillMoveToBottom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace